package com.javarush.test.level03.lesson06.task02;

/* Таблица умножения
Выведи на экран таблицу умножения 10 на 10 в следующем виде:
1 2 3 …
2 4 6 …
3 6 9 …
…
*/

public class Solution
{
    public static void main(String[] args)
    {
        int x1=1, x2=2, x3=3, x4=4, x5=5, x6=6, x7=7, x8=8, x9=9, x10=10, y1=1, y2=2, y3=3, y4=4, y5=5, y6=6, y7=7, y8=8, y9=9, y10=10;
        System.out.println(y1+" "+(y1*x2)+" "+(y1*x3)+" "+(y1*x4)+" "+(y1*x5)+" "+(y1*x6)+" "+(y1*x7)+" "+(y1*x8)+" "+(y1*x9)+" "+(y1*x10));
        System.out.println(y2+" "+(y2*x2)+" "+(y2*x3)+" "+(y2*x4)+" "+(y2*x5)+" "+(y2*x6)+" "+(y2*x7)+" "+(y2*x8)+" "+(y2*x9)+" "+(y2*x10));
        System.out.println(y3+" "+(y3*x2)+" "+(y3*x3)+" "+(y3*x4)+" "+(y3*x5)+" "+(y3*x6)+" "+(y3*x7)+" "+(y3*x8)+" "+(y3*x9)+" "+(y3*x10));
        System.out.println(y4+" "+(y4*x2)+" "+(y4*x3)+" "+(y4*x4)+" "+(y4*x5)+" "+(y4*x6)+" "+(y4*x7)+" "+(y4*x8)+" "+(y4*x9)+" "+(y4*x10));
        System.out.println(y5+" "+(y5*x2)+" "+(y5*x3)+" "+(y5*x4)+" "+(y5*x5)+" "+(y5*x6)+" "+(y5*x7)+" "+(y5*x8)+" "+(y5*x9)+" "+(y5*x10));
        System.out.println(y6+" "+(y6*x2)+" "+(y6*x3)+" "+(y6*x4)+" "+(y6*x5)+" "+(y6*x6)+" "+(y6*x7)+" "+(y6*x8)+" "+(y6*x9)+" "+(y6*x10));
        System.out.println(y7+" "+(y7*x2)+" "+(y7*x3)+" "+(y7*x4)+" "+(y7*x5)+" "+(y7*x6)+" "+(y7*x7)+" "+(y7*x8)+" "+(y7*x9)+" "+(y7*x10));
        System.out.println(y8+" "+(y8*x2)+" "+(y8*x3)+" "+(y8*x4)+" "+(y8*x5)+" "+(y8*x6)+" "+(y8*x7)+" "+(y8*x8)+" "+(y8*x9)+" "+(y8*x10));
        System.out.println(y9+" "+(y9*x2)+" "+(y9*x3)+" "+(y9*x4)+" "+(y9*x5)+" "+(y9*x6)+" "+(y9*x7)+" "+(y9*x8)+" "+(y9*x9)+" "+(y9*x10));
        System.out.println(y10+" "+(y10*x2)+" "+(y10*x3)+" "+(y10*x4)+" "+(y10*x5)+" "+(y10*x6)+" "+(y10*x7)+" "+(y10*x8)+" "+(y10*x9)+" "+(y10*x10));
    }
}